       IDENTIFICATION DIVISION.
       PROGRAM-ID.    NUM2STRXTRA.
       AUTHOR.        JULIAN VIDAL.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           PROGRAM libnum2pol.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERO-INP  PIC 9(12) BLANK WHEN ZERO.
       01  TEXTO-ES    PIC x(2000).
       01  VERSION-ES  PIC X(20).


       PROCEDURE DIVISION.
           CALL libnum2pol.

           CALL "VERSION_PO"   USING VERSION-ES.
           DISPLAY VERSION-ES.

           MOVE 123    TO NUMERO-INP.
           CALL "CONVERT_PO"   USING NUMERO-INP TEXTO-ES.
           DISPLAY TEXTO-ES.

           STOP  RUN.
       END PROGRAM NUM2STRXTRA.
