
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIBENTRY.
       AUTHOR. JULIAN VIDAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
           77  NUMERO  PIC X(12).
           77  TEXTO   PIC X(2000).

       PROCEDURE DIVISION.
           GOBACK.

       ENTRY "ENTRY-VERSION" USING NUMERO TEXTO.
           MOVE "ENTRY-VERSION: LIBENTRY 1.0" TO TEXTO
           GOBACK.

       ENTRY "ENTRY-TEST"  USING NUMERO TEXTO.
           MOVE "ENTRY-TEST: ENTRY TEST TEXT" TO TEXTO
           GOBACK.

       END PROGRAM LIBENTRY.

