
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIBENTRY.
       AUTHOR. JULIAN VIDAL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION ALL INTRINSIC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
           77  NUMERO  PIC X(12).
           77  TEXTO   PIC X(2000).

       PROCEDURE DIVISION USING NUMERO TEXTO.
           MOVE "LIBENTRY LOADING .........." TO TEXTO
           GOBACK.

       ENTRY-VERSION SECTION.
       ENTRY "ENTRY-VERSION" USING NUMERO TEXTO.
           MOVE "ENTRY-VERSION: LIBENTRY 1.0" TO TEXTO
           GOBACK.

       ENTRY-TEST SECTION.
       ENTRY "ENTRY-TEST"  USING NUMERO TEXTO.
           MOVE "ENTRY-TEST: ENTRY TEST TEXT" TO TEXTO
           GOBACK.

       END PROGRAM LIBENTRY.

