

       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP.
       AUTHOR. JULIAN VIDAL.
       DATA DIVISION.

       WORKING-STORAGE SECTION.


           INCLUDE GLOBAL_DEF.
           INCLUDE TRACE_DEF.
           INCLUDE STRCAT_DEF.
           INCLUDE NUM2STR_DEF.
           INCLUDE NUM2STRT_DEF.

       PROCEDURE DIVISION.

           PERFORM   301-INIT.
           PERFORM   301T-LOOPINIT.
           PERFORM   301T-LOOP.

           STOP RUN.


           INCLUDE TRACE_CODE.
           INCLUDE STRCAT_CODE.
           INCLUDE NUM2STR_CODE.
           INCLUDE NUM2STRT_CODE.

