
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRCAT.
       AUTHOR. JULIAN VIDAL.
       DATA DIVISION.
          
       WORKING-STORAGE SECTION.
           
           INCLUDE GLOBAL_DEF.
           INCLUDE TRACE_DEF.
           INCLUDE STRCAT_DEF.


       PROCEDURE DIVISION.

           PERFORM   300-TEST.

           STOP RUN.

           INCLUDE TRACE_CODE.
           INCLUDE STRCAT_CODE.

           INCLUDE STRCAT_TEST.
