       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIBNUM2ENSTR.
       AUTHOR. JULIAN VIDAL.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
           INCLUDE GLOBAL_DEF.
           INCLUDE STRCAT_DEF.
           INCLUDE NUM2ENSTR_DEF.

       LINKAGE SECTION.
           77  NUMERO  PIC X(12).
           77  TEXTO   PIC X(2000).


       PROCEDURE DIVISION USING NUMERO TEXTO.

           PERFORM   302-INIT.

           MOVE NUMERO   TO W302-NUMERO.

           PERFORM 302-CONVERT.

           MOVE W302-RESULT TO  TEXTO.

           GOBACK.

       INCLUDE STRCAT_CODE.
       INCLUDE NUM2ENSTR_CODE.

