
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIBNUM2STR.
       AUTHOR. JULIAN VIDAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
           INCLUDE NUM2ENSTR_DEF.
           INCLUDE NUM2ESSTR_DEF.

       LINKAGE SECTION.
           77  NUMERO  PIC X(12).
           77  TEXTO   PIC X(2000).


       PROCEDURE DIVISION.
           PERFORM   301-INIT.
           PERFORM   302-INIT.
           GOBACK.


       ENTRY "EN-CONVERT" USING NUMERO TEXTO.
           MOVE NUMERO   TO W302-NUMERO.
           PERFORM 302-CONVERT.
           MOVE W302-RESULT TO  TEXTO.
           GOBACK.

       ENTRY "ES-CONVERT" USING NUMERO TEXTO.
           MOVE NUMERO   TO W301-NUMERO.
           PERFORM 301-CONVERT.
           MOVE W301-RESULT TO  TEXTO.
           GOBACK.

       INCLUDE NUM2ENSTR_CODE.
       INCLUDE NUM2ESSTR_CODE.

       END PROGRAM LIBNUM2STR.
