
       WORKING-STORAGE SECTION.
       77  TEXTO1   PIC X(100).
       77  TEXTO2   PIC X(100).
       77  TEXTO3   PIC X(100).
       77  XEOF     PIC XX.

