           77  W307-VERSION  PIC X(20) VALUE 'NUM2ROSTR (1.0)'.

      *    Textos
           77 W307-CENTENAS    OCCURS 10 TIMES PIC X(20).
           77 W307-DECENAS     OCCURS 10 TIMES PIC X(20).
           77 W307-DECENAS-1   OCCURS 10 TIMES PIC X(20).
           77 W307-UNIDADES    OCCURS 10  TIMES PIC X(20).

