
       01  INPUT-SCREEN AUTO.

         05  BLANK SCREEN BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.


         05 LINE 2 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ENTRADA : ".
         05 COLUMN 22 REVERSE-VIDEO
           PIC Z(12) BLANK WHEN ZERO
           USING NUMERO-INP.


         05 LINE 2 COLUMN 40 BACKGROUND-COLOR 1
           VALUE IS "RESULTADO : [              ]".
         05 COLUMN 54  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC Z(12) BLANK WHEN ZERO
           FROM NUMERO-CUR.


         05 LINE 4 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ESPANOL   : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC X(150)
           FROM TEXTO-ES.

         05 LINE 7 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "INGLES    : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC X(150)
           FROM TEXTO-EN.

         05 LINE 10 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "FRANCES   : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC X(150)
           FROM TEXTO-FR.

         05 LINE 13 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ALEMAN    : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC X(150)
           FROM TEXTO-DE.

         05 LINE 16 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ITALIANO  : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC X(150)
           FROM TEXTO-IT.

         05 LINE 19 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "NORUEGO   : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC X(150)
           FROM TEXTO-NO.

         05 LINE 22 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "PORTUGUES : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6 HIGHLIGHT
           PIC X(150)
           FROM TEXTO-PO.

