
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ENTRY.
       AUTHOR.        JULIAN VIDAL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           PROGRAM LIBENTRY.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  NUMERO      PIC 9(12) BLANK WHEN ZERO.
       01  TEXTO-EN    PIC x(2000).
       77  LINEA       PIC 99  VALUE ZERO.

       PROCEDURE DIVISION.
           PERFORM LIBS-LOADER.
           PERFORM TESTS.
           STOP RUN.

       TESTS.
           MOVE 3  TO LINEA.
           MOVE "012345678921"  TO NUMERO.

           CALL "ENTRY-VERSION" USING NUMERO TEXTO-EN END-CALL.
           DISPLAY TEXTO-EN  LINE LINEA POSITION 10.
           ADD 1 TO LINEA.

           CALL "ENTRY-TEST" USING NUMERO TEXTO-EN END-CALL.
           DISPLAY TEXTO-EN  LINE LINEA POSITION 10.
           ADD 1 TO LINEA.


       LIBS-LOADER.
           CALL "LIBENTRY".

       END PROGRAM ENTRY.
