       IDENTIFICATION DIVISION.
       PROGRAM-ID.    NUM2STRPLUS.
       AUTHOR.        JULIAN VIDAL.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           PROGRAM NUM2ES AS 'LIBESNUM2STR'
           PROGRAM NUM2EN AS 'LIBENNUM2STR'.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERO      PIC 9(12) BLANK WHEN ZERO.
       01  NUMERO-CUR  PIC 9(12) BLANK WHEN ZERO.
       01  TEXTO-EN    PIC x(2000).
       01  TEXTO-ES    PIC x(2000).

       SCREEN SECTION.
       INCLUDE NUMBER-SCRN.


       PROCEDURE DIVISION.

           MOVE "1"  TO NUMERO.
           MOVE  NUMERO  TO  NUMERO-CUR.

           PERFORM 000-TEST
             UNTIL NUMERO = ' '.

           STOP  RUN.

       000-TEST.
           CALL NUM2EN   USING NUMERO TEXTO-EN.
           CALL NUM2ES   USING NUMERO TEXTO-ES.
           MOVE  NUMERO  TO  NUMERO-CUR.

           DISPLAY INPUT-SCREEN.

           MOVE 0 TO NUMERO.
           ACCEPT  INPUT-SCREEN.

