       IDENTIFICATION DIVISION.
       PROGRAM-ID.    NUM2STR.
       AUTHOR.        JULIAN VIDAL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           PROGRAM LIBESNUM2STR.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  PARAMETRO   PIC x(12).
       01  TEXTO       PIC x(2000).

       PROCEDURE DIVISION.

           MOVE "012345678921"  TO PARAMETRO.
           CALL LIBESNUM2STR USING PARAMETRO TEXTO.

           DISPLAY PARAMETRO LINE 10 POSITION 10.
           DISPLAY TEXTO     LINE 12 POSITION 10.

           STOP  RUN.

