           77  W308-VERSION  PIC X(20) VALUE 'NUM2ITSTR (1.0)'.

      *    Textos
           77 W308-CENTENAS    OCCURS 10 TIMES PIC X(20).
           77 W308-DECENAS     OCCURS 10 TIMES PIC X(20).
           77 W308-DECENAS-1   OCCURS 10 TIMES PIC X(20).
           77 W308-UNIDADES    OCCURS 10  TIMES PIC X(20).

