
           77 W001-Buffer     PIC X(2000).
           77 W001-Parts  redefines W001-Buffer OCCURS 2000 TIMES PIC X. 
           77 W001-Buffer-Len PIC 9999 VALUE 0.
           77 W001-Idx PIC 9999 VALUE 1.
           77 W001-Title     PIC A(10).

