

           77 WS-In  PIC X(200).
           77 WS-In-Chars redefines WS-In OCCURS 200 TIMES PIC X.
           77 WS-In-Idx PIC 999 VALUE 1.
           77 WS-In-EOF PIC 1 VALUE 0.
           
           77 WS-Out     PIC X(2000).
           77 WS-Out-Chars  redefines WS-Out OCCURS 2000 TIMES PIC X. 
           77 WS-Out-Len PIC 9999 VALUE 0.
           77 WS-Out-Idx PIC 9999 VALUE 1.
