
       SCREEN SECTION.
       01  CLEAR-SCREEN.
         05  BLANK SCREEN BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.

       01  INPUT-SCREEN AUTO.

         05  BLANK SCREEN BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.

         05 LINE 4 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ENTRADA : ".
         05 COLUMN 22 REVERSE-VIDEO
           PIC 9(12) BLANK WHEN ZERO
           USING NUMERO.

         05 LINE 8 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "NUMERO  : ".
         05 COLUMN 22 REVERSE-VIDEO
           PIC 9(12) BLANK WHEN ZERO
           FROM NUMERO-CUR.

         05 LINE 10 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ESPANOL : ".
         05 LINE 11 COLUMN 22 REVERSE-VIDEO
           PIC X(150)
           FROM TEXTO-ES.

         05 LINE 15 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "INGLES  : ".
         05 LINE 16 COLUMN 22 REVERSE-VIDEO
           PIC X(150)
           FROM TEXTO-EN.

