
       01  INPUT-SCREEN AUTO.

         05  BLANK SCREEN BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.

         05 LINE 1 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "VERSION : ".
         05 COLUMN 22 BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(20)
           FROM  VERSION-APP.
         05 LINE 2 COLUMN 22 BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(20)
           FROM  VERSION-EN.
         05 COLUMN 42 BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(20)
           FROM  VERSION-ES.
         05 COLUMN 62 BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(20)
           FROM  VERSION-DE.
         05 COLUMN 82 BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(20)
           FROM  VERSION-FR.

         05 LINE 4 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ENTRADA : ".
         05 COLUMN 22 REVERSE-VIDEO
           PIC 9(12) BLANK WHEN ZERO
           USING NUMERO-INP.

         05 LINE 7 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "NUMERO  : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC 9(12) BLANK WHEN ZERO
           FROM NUMERO-CUR.

         05 LINE 10 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ESPANOL : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(150)
           FROM TEXTO-ES.

         05 LINE 13 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "INGLES  : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(150)
           FROM TEXTO-EN.

         05 LINE 16 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "ALEMAN  : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(150)
           FROM TEXTO-DE.

         05 LINE 19 COLUMN 10 BACKGROUND-COLOR 1
           VALUE IS "FRANCES : ".
         05 COLUMN 22  BACKGROUND-COLOR 1 FOREGROUND-COLOR 6
           PIC X(150)
           FROM TEXTO-FR.

