
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ENTRY.
       AUTHOR.        JULIAN VIDAL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           PROGRAM LIBENTRY.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  NUMERO      PIC 9(12) BLANK WHEN ZERO.
       01  TEXTO-EN    PIC x(2000).

       PROCEDURE DIVISION.

           MOVE "012345678921"  TO NUMERO.

           CALL LIBENTRY USING NUMERO TEXTO-EN.

           DISPLAY NUMERO    LINE 10 POSITION 10.
           DISPLAY TEXTO-EN  LINE 12 POSITION 10.

           STOP  RUN.

