
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    NUM2STR.
       AUTHOR.        JULIAN VIDAL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           PROGRAM NUM2ES AS 'LIBESNUM2STR'
           PROGRAM NUM2EN AS 'LIBENNUM2STR'.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERO      PIC 9(12) BLANK WHEN ZERO.
       01  TEXTO-EN    PIC x(2000).
       01  TEXTO-ES    PIC x(2000).

       SCREEN SECTION.
       01  CLEAR-SCREEN.
         05  BLANK SCREEN BACKGROUND-COLOR 6 FOREGROUND-COLOR 2.

       01  INPUT-SCREEN AUTO.
         05 LINE 4 COLUMN 10 VALUE IS "NUMERO  : ".
         05 S-NUMERO  REVERSE-VIDEO PIC 9(12) BLANK WHEN ZERO
           USING NUMERO.

         05 LINE 10 COLUMN 10 VALUE IS "ESPANOL : ".
         05 S-TEXTO-ES LINE 11 COLUMN 22  PIC X(200)
           USING TEXTO-ES.

         05 LINE 15 COLUMN 10 VALUE IS "INGLES  : ".
         05 S-TEXTO-EN LINE 16 COLUMN 22  PIC X(200)
           USING TEXTO-EN.

       PROCEDURE DIVISION.

           MOVE "1"  TO NUMERO.


           PERFORM 000-TEST
             UNTIL NUMERO = ' '.

           STOP  RUN.

       000-TEST.
           CALL NUM2EN   USING NUMERO TEXTO-EN.
           CALL NUM2ES   USING NUMERO TEXTO-ES.

           DISPLAY CLEAR-SCREEN.
           DISPLAY INPUT-SCREEN.

           MOVE 0 TO NUMERO.
           ACCEPT  INPUT-SCREEN.

      *DISPLAY NUMERO    LINE 10 POSITION 10.
      *     DISPLAY TEXTO-EN  LINE 12 POSITION 10.
      *     DISPLAY TEXTO-ES  LINE 15 POSITION 10.
      *ACCEPT  NUMERO    LINE  2 POSITION 10.


