
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    NUM2STR.
       AUTHOR.        JULIAN VIDAL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           PROGRAM NUM2ES AS 'LIBESNUM2STR'
           PROGRAM NUM2EN AS 'LIBENNUM2STR'.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERO      PIC 9(12) BLANK WHEN ZERO.
       01  NUMERO-CUR  PIC 9(12) BLANK WHEN ZERO.
       01  TEXTO-EN    PIC x(2000).
       01  TEXTO-ES    PIC x(2000).

       SCREEN SECTION.
       01  CLEAR-SCREEN.
         05  BLANK SCREEN BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.

       01  INPUT-SCREEN AUTO.

         05 LINE 4 COLUMN 10 VALUE IS "ENTRADA : ".
         05 S-NUMERO  COLUMN 22 REVERSE-VIDEO PIC 9(12)
           BLANK WHEN ZERO
           USING NUMERO.

         05 LINE 8 COLUMN 10 VALUE IS "NUMERO  : ".
         05 S-NUMERO-CUR COLUMN 22 REVERSE-VIDEO
           PIC 9(12) BLANK WHEN ZERO
           USING NUMERO-CUR.

         05 LINE 10 COLUMN 10 VALUE IS "ESPANOL : ".
         05 S-TEXTO-ES LINE 11 COLUMN 22 REVERSE-VIDEO
           PIC X(150) USING TEXTO-ES.

         05 LINE 15 COLUMN 10 VALUE IS "INGLES  : ".
         05 S-TEXTO-EN LINE 16 COLUMN 22 REVERSE-VIDEO
           PIC X(150) USING TEXTO-EN.

       PROCEDURE DIVISION.

           MOVE "1"  TO NUMERO.
           MOVE  NUMERO  TO  NUMERO-CUR.

           PERFORM 000-TEST
             UNTIL NUMERO = ' '.

           STOP  RUN.

       000-TEST.
           CALL NUM2EN   USING NUMERO TEXTO-EN.
           CALL NUM2ES   USING NUMERO TEXTO-ES.
           MOVE  NUMERO  TO  NUMERO-CUR.

           DISPLAY CLEAR-SCREEN.
           DISPLAY INPUT-SCREEN.

           MOVE 0 TO NUMERO.
           ACCEPT  INPUT-SCREEN.
