
       301-TRACE-RESULT.
           MOVE "STRCAT"     TO W001-Title.
           MOVE W300-Out     TO W001-Buffer.
           MOVE W300-Out-len TO W001-Buffer-Len.
           PERFORM 001-TRACE.
           DISPLAY " ".


       301-TRACE-INPUT.
           MOVE "NUMBER"   TO W001-Title.
           MOVE W301-NUM   TO W001-Buffer.
           MOVE 12         TO W001-Buffer-Len.
           PERFORM 001-TRACE.


       301-TEST-BODY.
           PERFORM 301-TRACE-INPUT.
           PERFORM 301-CONVERT.
           PERFORM 301-TRACE-RESULT.


       301-TEST.

           MOVE "000000000001" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000005" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000010" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000011" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000020" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000023" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000099" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000100" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000101" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000150" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000159" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000300" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000000990" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000001000" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000001001" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000001100" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000001101" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000021101" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000000620101" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           DISPLAY "---".


           MOVE "000001789012" TO W301-NUM.
           PERFORM 301-TEST-BODY.

           MOVE "000002789012" TO W301-NUM.
           PERFORM 301-TEST-BODY.


       301T-LOOP.
           PERFORM 301T-LOOP-ITM
             VARYING W301T_IDX FROM 1 BY 1 UNTIL W301T_IDX > 30.


       301T-LOOP-ITM.
           MOVE W301T_NUMS(W301T_IDX)  TO W301-NUM.
           PERFORM 301-TEST-BODY.


       301T-LOOPINIT.

           MOVE 0 TO W301T_NUMS(1).
           MOVE 1 TO W301T_NUMS(2).
           MOVE 4 TO W301T_NUMS(3).
           MOVE 10 TO W301T_NUMS(4).
           MOVE 11 TO W301T_NUMS(5).
           MOVE 15 TO W301T_NUMS(6).
           MOVE 20 TO W301T_NUMS(7).
           MOVE 22 TO W301T_NUMS(8).
           MOVE 70 TO W301T_NUMS(9).
           MOVE 99 TO W301T_NUMS(10).

           MOVE 100 TO W301T_NUMS(11).
           MOVE 101 TO W301T_NUMS(12).
           MOVE 104 TO W301T_NUMS(13).
           MOVE 110 TO W301T_NUMS(14).
           MOVE 111 TO W301T_NUMS(15).
           MOVE 215 TO W301T_NUMS(16).
           MOVE 520 TO W301T_NUMS(17).
           MOVE 622 TO W301T_NUMS(18).
           MOVE 970 TO W301T_NUMS(19).
           MOVE 999 TO W301T_NUMS(20).

           MOVE 1000 TO W301T_NUMS(21).
           MOVE 1001 TO W301T_NUMS(22).
           MOVE 1004 TO W301T_NUMS(23).
           MOVE 1110 TO W301T_NUMS(24).
           MOVE 1111 TO W301T_NUMS(25).
           MOVE 2015 TO W301T_NUMS(26).
           MOVE 5020 TO W301T_NUMS(27).
           MOVE 6022 TO W301T_NUMS(28).
           MOVE 9870 TO W301T_NUMS(29).
           MOVE 9999 TO W301T_NUMS(30).

