           77  W301-VERSION  PIC X(20) VALUE 'NUM2ESSTR (1.0)'.

      *    Textos
           77 W301-CENTENAS    OCCURS 10 TIMES PIC X(20).
           77 W301-DECENAS     OCCURS 10 TIMES PIC X(20).
           77 W301-DECENAS-1   OCCURS 10 TIMES PIC X(20).
           77 W301-UNIDADES    OCCURS 10  TIMES PIC X(20).

