
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIBENTRY2.
       AUTHOR. JULIAN VIDAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
           77  NUMERO  PIC X(12).
           77  TEXTO   PIC X(2000).

       PROCEDURE DIVISION.
           GOBACK.

       ENTRY "ENTRY2-VERSION" USING NUMERO TEXTO.
           MOVE "ENTRY2-VERSION: LIBENTRY 1.0" TO TEXTO
           GOBACK.

       ENTRY "ENTRY2-TEST"  USING NUMERO TEXTO.
           MOVE "ENTRY2-TEST: ENTRY TEST TEXT" TO TEXTO
           GOBACK.

       END PROGRAM LIBENTRY2.

