           77  W306-VERSION  PIC X(20) VALUE 'NUM2NOSTR (1.0)'.


      *    Textos
           77 W306-DECENAS     OCCURS 10 TIMES PIC X(20).
           77 W306-DECENAS-1   OCCURS 10 TIMES PIC X(20).
           77 W306-UNIDADES    OCCURS 10  TIMES PIC X(20).

